kyriosaa/e2c-pdm/edge/esp32/firmware/mdc/mdc.ino
// ESP32-S3
// motor dataset collection rig
//
// IDE settings:
//   Tools -> "USB CDC On Boot: DISABLED"  (Serial = UART0 -> CH343 bridge)
//
// note!!
// the BTS7960s on the IBT-2 have internal pull-downs on IN and INH, 
// so ESP32 pins floating during boot or flashing read LOW at the driver and the bridge stays disabled
//
//   POWER SEQUENCING RULE: plug in the USB first, then turn on the power supply. never flash with 24V present

#include <SPI.h>
#include <Wire.h>
#include <Adafruit_MLX90614.h>
#include <driver/i2s.h>
#include <esp_task_wdt.h>
#include <esp_system.h>
#include <driver/gpio.h>

// GY-906 (MLX90614) - temperature (I2C)
#define MLX90614_SCL 4
#define MLX90614_SDA 5

// vibration (SPI). Two ST boards, both in the path:
//   STEVAL-MKI208V1K  carries the IIS3DWB itself, sensor soldered centre-board,
//                     adhesive-mounted on the motor frame. This is the part the
//                     datasheet numbers refer to.
//   STEVAL-MKIGIBV2   DIL24 adapter it cables into; what the PCB actually
//                     footprints (see edge/hardware/*/sensors.kicad_sch).
#define IIS3DWB_CS  13
#define IIS3DWB_SCL 12  // SCK
#define IIS3DWB_SDA 11  // MOSI
#define IIS3DWB_SDO 10  // MISO

// INMP441 - acoustic (I2S)
#define I2S_SD      18
#define I2S_SCK     17
#define I2S_WS      16
#define I2S_PORT    I2S_NUM_0

// IBT_2 - motor driver
#define MOTOR_RPWM 41
#define MOTOR_LPWM 40
#define MOTOR_R_EN 38
#define MOTOR_L_EN 39

// ACS712-30A on the motor's +12 V lead, read through the 10k/15k divider on the
// sensors sheet (net ISENSE). The sensor swings 0-5 V and this ADC reads to
// ~3.1 V, so the divider is not optional -- without it the pin is over-driven.
#define CURRENT_SENSE_PIN 7                                  // ADC1_CH6

// run config
static const float    TRIP_TEMP_C     = 70.0f;                      // kills system at 70 deg (based on the ISO-13732-1 burn threshold)
static const uint32_t TEMP_STALE_MS   = 5000;                       // sensor-lost timeout
static const uint32_t MAX_RUN_MS      = 6UL * 60UL * 60UL * 1000UL; // 6 h cap
// Running duty, -255..255. This is the THROTTLE. Lower it to run slower --
// do not use the PSU current limit for that. A current-limited motor changes
// speed on its own as friction and temperature drift, so the operating point
// would not be stable within a session, let alone between them.
// Effective motor voltage is roughly supply x MOTOR_SPEED/255.
static const int      MOTOR_SPEED     = 150;

// Kick-start. Breaking away needs more torque than keeping turning, so a low
// MOTOR_SPEED may not start the motor at all -- it sits and squeals instead.
// Start at KICK_SPEED for KICK_MS, then ease down to MOTOR_SPEED. If
// MOTOR_SPEED >= KICK_SPEED there is nothing to kick and this does nothing.
// Non-blocking: the loop keeps running, so 'X' still stops the motor mid-kick.
// Kept only as high as it needs to be -- a harder kick than necessary just
// slams the coupling and shakes the frame on every start.
// 2026-08-24: 160 (~7.5 V effective) would not break away, but the motor ran
// fine wired straight to the 12 V PSU. Raised to 255 -- and the motor STILL
// did not break away, with pwm_duty telemetry confirming 255 was applied. So
// the shortfall is in the drive electronics, not the commanded duty; 255 is
// kept as the correct kick regardless. See quirk register 2.14.
static const int      KICK_SPEED      = 255;
static const uint32_t KICK_MS         = 1500;   // full duty, to break away
static const uint32_t RAMP_MS         = 2000;   // then ease down to MOTOR_SPEED

// Why ease down rather than step down: breaking away from rest needs far more
// torque than staying turning, so the motor can be spinning happily at full
// duty and still stall if the duty is yanked straight back to MOTOR_SPEED
// before it has picked up speed. The ramp lets it settle instead.

static const uint32_t WDT_TIMEOUT_MS  = 5000;                       // watchdog timeout

// Current sensing. The 30 A part gives 66 mV/A, which the divider scales to
// ~39.6 mV/A at the pin -- coarse for a motor drawing 1-6 A, so the reading is
// averaged over CURRENT_SAMPLES rather than taken as a single sample. The burst
// also spans several PWM periods, which matters: the drive is chopped, so one
// instantaneous sample says nothing useful about the mean current.
static const float    CURRENT_DIVIDER  = 15.0f / (10.0f + 15.0f);   // 0.6
static const float    ACS712_MV_PER_A  = 66.0f;                     // 30 A variant
static const int      CURRENT_SAMPLES  = 64;

// Zero-current output, measured at boot while the motor is definitely off.
// Nominally VCC/2 x divider = 1500 mV, but the real figure depends on the 5 V
// rail and the part's own offset, so it is measured rather than assumed. A
// reading far from ~1500 mV means the sensor or the divider is not connected.
static uint32_t       currentZeroMv    = 0;

// Accelerometer full scale. CHANGED 2026-07-30 from +/-16 g to +/-4 g.
//
// Measured on the three 6 h pilot sessions recorded at +/-16 g: running RMS is
// 0.043 g (15 V) to 0.056 g (24 V) with a worst-case peak of 1.16 g. At
// +/-16 g (0.488 mg/LSB) an RMS of 0.056 g is only ~115 LSB, i.e. about 7 of
// the 16 available bits were carrying signal.
//
// +/-4 g gives 0.122 mg/LSB -- 4x finer resolution, ~9 bits at the same RMS --
// while still leaving 3.4x headroom over the observed 1.16 g peak. +/-2 g was
// rejected as too tight for the impulsive transients that seeded faults are
// expected to produce.
//
// IF THIS IS CHANGED AGAIN: data recorded either side of the change is not
// resolution-comparable. data_catcher.py writes ACCEL_FS_G into every
// session.json so analysis code scales each session correctly; the two values
// must be kept in step (ml/config.py documents both).
//
// IIS3DWB CTRL1_XL (10h). Verified against DS12569 Rev 8, Table 28 (register
// layout) and Table 30 (full-scale selection), p.32:
//   bit 7..5  XL_EN[2:0]   101 = accelerometer enabled, 000 = power-down
//   bit 4     must be 0
//   bit 3..2  FS[1:0]_XL   00 = +/-2 g (default), 01 = +/-16 g,
//                          10 = +/-4 g,           11 = +/-8 g
//   bit 1     LPF2_XL_EN   0 = first filtering stage output
//   bit 0     must be 0
//   0xA4 = 1010_0100 -> FS_XL=01 -> +/-16 g   (pilot sessions 2026-07-16..20)
//   0xA8 = 1010_1000 -> FS_XL=10 -> +/-4 g    (current)
static const uint8_t  IIS3DWB_CTRL1_XL_VAL = 0xA8;                  // XL on @ 26.7 kHz, FS +/-4 g
static const float    ACCEL_FS_G           = 4.0f;                  // must match the register above

// CTRL1_XL as read back from the device after configuration; 0xFF until
// setupIIS3DWB() has run. Shipped in every status packet so the host records
// the full scale the hardware reports rather than the one it was told to
// expect. Four sessions were recorded at +/-16 g while every session.json
// claimed +/-4 g, because the constants above were edited but the build was
// never flashed and nothing compared intent against hardware.
static volatile uint8_t iisCtrl1XL = 0xFF;
#define REQUIRE_HOST_ARM 1       

// fault handler
enum FaultCode : uint8_t {
  FAULT_NONE          = 0,
  FAULT_OVERTEMP      = 1,
  FAULT_TEMP_SENSOR   = 2,   // GY-906 stopped answering
  FAULT_RUNTIME_DONE  = 3,   // planned end of run
  FAULT_BAD_RESET     = 4,   // rebooted via WDT/panic/brownout (stay off)
  FAULT_VIB_INIT      = 5,   // IIS3DWB WHO_AM_I or CTRL1_XL readback failed
  FAULT_HOST_STOP     = 6,   // logger sent 'X' or disconnected intentionally
};

static volatile uint8_t faultCode = FAULT_NONE;

// binary packet protocol
enum PacketType : uint8_t { PKT_VIB = 0, PKT_AUDIO = 1, PKT_STATUS = 2 };

// flags bits
#define FLAG_FIFO_OVERRUN 0x01
#define FLAG_FAULTED      0x02

