kyriosaa/e2c-pdm/edge/esp32/firmware/mdc/mdc.ino
struct __attribute__((packed)) PacketHeader {
  uint16_t magic;        // 0xA55A
  uint8_t  type;         // PacketType
  uint8_t  flags;
  uint32_t seq;          // per-stream sequence number
  uint16_t payloadLen;   // bytes
  uint16_t dropped;      // samples lost since previous packet (0xFFFF = unknown)
};

struct __attribute__((packed)) StatusPayload {
  float    objTempC;
  float    ambTempC;
  uint8_t  motorRunning;
  uint8_t  faultCode;
  uint32_t uptimeS;
  uint32_t vibPackets;
  uint32_t audioPackets;
  uint16_t fifoOverruns;
  uint32_t txDropped;    // whole packets skipped bcs USB TX buffer was full
  uint8_t  ctrl1XL;      // CTRL1_XL read back from the sensor; host derives FS
  int16_t  pwmDuty;      // duty actually applied right now, -255..255. The host
                         // records this instead of trusting MOTOR_SPEED, and it
                         // shows the kick and ramp as they happen.
  int16_t  currentMa;    // motor current, milliamps, signed (direction matters)
};

static SemaphoreHandle_t serialMutex;
static uint32_t seqVib = 0, seqAudio = 0, seqStatus = 0;
static volatile uint16_t fifoOverrunCount = 0;
static volatile uint32_t txDroppedPackets = 0;   // whole packets skipped bcs USB full

static uint16_t crc16ccitt(const uint8_t *d, size_t n, uint16_t crc = 0xFFFF) {
  for (size_t i = 0; i < n; i++) {
    crc ^= (uint16_t)d[i] << 8;
    for (int b = 0; b < 8; b++)
      crc = (crc & 0x8000) ? (crc << 1) ^ 0x1021 : (crc << 1);
  }
  return crc;
}

static void sendPacket(uint8_t type, uint8_t flags, uint32_t seq,
                       const uint8_t *payload, uint16_t len, uint16_t dropped) {
  PacketHeader h;
  h.magic = 0xA55A;
  h.type = type;
  h.flags = flags | (faultCode != FAULT_NONE ? FLAG_FAULTED : 0);
  h.seq = seq;
  h.payloadLen = len;
  h.dropped = dropped;

  uint16_t crc = crc16ccitt((const uint8_t *)&h, sizeof(h));
  crc = crc16ccitt(payload, len, crc);

  const size_t total = sizeof(h) + len + 2;
  xSemaphoreTake(serialMutex, portMAX_DELAY);
  size_t w = Serial.write((const uint8_t *)&h, sizeof(h));
  if (w == sizeof(h)) {
    w += Serial.write(payload, len);
    w += Serial.write((const uint8_t *)&crc, 2);
  }
  if (w != total) txDroppedPackets++;
  xSemaphoreGive(serialMutex);
}

// motor control
// pins are forced safe before anything else happens in setup()
static volatile bool motorRunning = false;

static const gpio_num_t MOTOR_PINS[4] = {
  (gpio_num_t)MOTOR_R_EN, (gpio_num_t)MOTOR_L_EN,
  (gpio_num_t)MOTOR_RPWM, (gpio_num_t)MOTOR_LPWM
};

static void motorPinsSafe() {
  // release a pad hold from a previous fault bcs it survives soft resets
  // otherwise the pinMode/digitalWrite functions silently do nothing
  for (auto p : MOTOR_PINS) gpio_hold_dis(p);
  pinMode(MOTOR_R_EN, OUTPUT); digitalWrite(MOTOR_R_EN, LOW);
  pinMode(MOTOR_L_EN, OUTPUT); digitalWrite(MOTOR_L_EN, LOW);
  pinMode(MOTOR_RPWM, OUTPUT); digitalWrite(MOTOR_RPWM, LOW);
  pinMode(MOTOR_LPWM, OUTPUT); digitalWrite(MOTOR_LPWM, LOW);
}

// Start-up shaping. rampEndsMs == 0 means "not starting up, hold runSpeed".
static uint32_t kickEndsMs = 0;      // end of the full-duty kick
static uint32_t rampEndsMs = 0;      // end of the ease-down
static uint32_t lastRampMs = 0;      // throttles how often the duty is rewritten
static int      runSpeed   = 0;      // duty to settle at

// The duty actually being applied right now, shipped in every status packet so
// the host records what the board is really doing rather than what the firmware
// constant claims. Same reasoning as the CTRL1_XL readback above: a declared
// constant is not evidence. Signed, -255..255.
static volatile int16_t appliedDuty = 0;

// Averaged ADC read in millivolts. analogReadMilliVolts applies the chip's
// factory ADC calibration, so this is real millivolts rather than raw counts
// that would need a per-board scale factor.
static uint32_t readSenseMv() {
  uint32_t acc = 0;
  for (int i = 0; i < CURRENT_SAMPLES; i++) acc += analogReadMilliVolts(CURRENT_SENSE_PIN);
  return acc / CURRENT_SAMPLES;
}

static int16_t readCurrentMa() {
  const float mvPerA = ACS712_MV_PER_A * CURRENT_DIVIDER;    // ~39.6 mV/A at the pin
  float ma = ((float)readSenseMv() - (float)currentZeroMv) / mvPerA * 1000.0f;
  if (ma >  32000.0f) ma =  32000.0f;                        // keep it in int16
  if (ma < -32000.0f) ma = -32000.0f;
  return (int16_t)ma;
}

static void motorApply(int speed) {
  if (speed >= 0) { analogWrite(MOTOR_LPWM, 0);     analogWrite(MOTOR_RPWM, speed);  }
  else            { analogWrite(MOTOR_RPWM, 0);     analogWrite(MOTOR_LPWM, -speed); }
  appliedDuty = (int16_t)speed;
}

static void motorKill(uint8_t code) {
  kickEndsMs = rampEndsMs = 0;    // a kill mid-start-up must not be undone
  digitalWrite(MOTOR_R_EN, LOW);
  digitalWrite(MOTOR_L_EN, LOW);
  analogWrite(MOTOR_RPWM, 0);
  analogWrite(MOTOR_LPWM, 0);
  appliedDuty = 0;
  // clamp the pads LOW in hardware so nothing short of a power cycle can re-enable the driver after a fault
  for (auto p : MOTOR_PINS) gpio_hold_en(p);
  motorRunning = false;
  if (faultCode == FAULT_NONE) faultCode = code;  // first fault wins, latched
}

static void motorStart(int speed) {          // -255 to 255
  if (faultCode != FAULT_NONE) return;       // latched, no restart until reset
  digitalWrite(MOTOR_R_EN, HIGH);
  digitalWrite(MOTOR_L_EN, HIGH);
  runSpeed = speed;
  if (abs(speed) < KICK_SPEED && (KICK_MS || RAMP_MS)) {
    motorApply(speed >= 0 ? KICK_SPEED : -KICK_SPEED);
    kickEndsMs = millis() + KICK_MS;
    rampEndsMs = kickEndsMs + RAMP_MS;
    lastRampMs = 0;
    if (rampEndsMs == 0) rampEndsMs = 1;     // 0 is the "settled" sentinel
  } else {
    motorApply(speed);                       // already full duty, nothing to do
    kickEndsMs = rampEndsMs = 0;
  }
  motorRunning = true;
}

// IIS3DWB
// hardware FIFO, continuous mode, drained in bursts
#define IIS3DWB_WHO_AM_I    0x0F  // must read 0x7B
#define IIS3DWB_FIFO_CTRL3  0x09
#define IIS3DWB_FIFO_CTRL4  0x0A
#define IIS3DWB_CTRL1_XL    0x10
#define IIS3DWB_CTRL3_C     0x12
#define IIS3DWB_FIFO_STAT1  0x3A
#define IIS3DWB_FIFO_STAT2  0x3B
#define IIS3DWB_FIFO_TAG    0x78  // tag + 6 data bytes follow (auto-increment)

static const SPISettings iisSPI(8000000, MSBFIRST, SPI_MODE0);

static void iisWrite(uint8_t reg, uint8_t val) {
  SPI.beginTransaction(iisSPI);
  digitalWrite(IIS3DWB_CS, LOW);
  SPI.transfer(reg & 0x7F);
  SPI.transfer(val);
  digitalWrite(IIS3DWB_CS, HIGH);
  SPI.endTransaction();
}

static uint8_t iisRead(uint8_t reg) {
  SPI.beginTransaction(iisSPI);
  digitalWrite(IIS3DWB_CS, LOW);
  SPI.transfer(reg | 0x80);
  uint8_t v = SPI.transfer(0x00);
  digitalWrite(IIS3DWB_CS, HIGH);
  SPI.endTransaction();
  return v;
}

static bool setupIIS3DWB() {
  pinMode(IIS3DWB_CS, OUTPUT);
  digitalWrite(IIS3DWB_CS, HIGH);
  SPI.begin(IIS3DWB_SCL, IIS3DWB_SDO, IIS3DWB_SDA, IIS3DWB_CS);
  delay(20);

