kyriosaa/e2c-pdm/edge/esp32/firmware/mdc/mdc.ino
  iisWrite(IIS3DWB_CTRL3_C, 0x01);            // SW_RESET
  delay(20);
  if (iisRead(IIS3DWB_WHO_AM_I) != 0x7B) return false;

  iisWrite(IIS3DWB_CTRL3_C,   0x44);          // BDU + IF_INC
  iisWrite(IIS3DWB_FIFO_CTRL3, 0x0A);         // batch XL at 26.7 kHz
  iisWrite(IIS3DWB_FIFO_CTRL4, 0x06);         // FIFO continuous mode
  iisWrite(IIS3DWB_CTRL1_XL,  IIS3DWB_CTRL1_XL_VAL);   // XL on @ 26.7 kHz, FS per ACCEL_FS_G

  // Verify the full scale actually took. A blind write here is invisible until
  // someone measures 1 g and finds it in the wrong place, by which point the
  // sessions are already recorded. Failing init latches FAULT_VIB_INIT, which
  // holds the motor off, so a mis-scaled run stops before it starts.
  delay(5);
  iisCtrl1XL = iisRead(IIS3DWB_CTRL1_XL);
  if (iisCtrl1XL != IIS3DWB_CTRL1_XL_VAL) return false;

  return true;
}

// returns unread FIFO words
// sets *overrun if the FIFO wrapped (data lost)
static uint16_t fifoStatus(bool *overrun) {
  SPI.beginTransaction(iisSPI);
  digitalWrite(IIS3DWB_CS, LOW);
  SPI.transfer(IIS3DWB_FIFO_STAT1 | 0x80);
  uint8_t s1 = SPI.transfer(0x00);
  uint8_t s2 = SPI.transfer(0x00);
  digitalWrite(IIS3DWB_CS, HIGH);
  SPI.endTransaction();
  *overrun = (s2 & 0x40) != 0;                // FIFO_OVR_IA
  return ((uint16_t)(s2 & 0x03) << 8) | s1;   // DIFF_FIFO[9:0]
}

// CORE 1 vibration task
// drains the FIFO in chunk-word bursts and ships each burst as one packet
// sample loss will show up as the overrun flag + dropped counter instead of just silently vanishing
static void vibTask(void *) {
  esp_task_wdt_add(NULL);
  const int CHUNK = 64;                        // 64 samples = 2.4 ms of data
  static int16_t buf[CHUNK * 3];

  for (;;) {
    esp_task_wdt_reset();
    bool ovr = false;
    uint16_t avail = fifoStatus(&ovr);
    if (ovr) fifoOverrunCount++;

    while (avail >= CHUNK) {
      int n = 0;
      SPI.beginTransaction(iisSPI);
      for (int i = 0; i < CHUNK; i++) {
        digitalWrite(IIS3DWB_CS, LOW);
        SPI.transfer(IIS3DWB_FIFO_TAG | 0x80);
        uint8_t tag = SPI.transfer(0x00);
        uint8_t d[6];
        for (int j = 0; j < 6; j++) d[j] = SPI.transfer(0x00);
        digitalWrite(IIS3DWB_CS, HIGH);
        if (((tag >> 3) & 0x1F) == 0x02) {     // accelerometer data word
          buf[n * 3 + 0] = (int16_t)((d[1] << 8) | d[0]);
          buf[n * 3 + 1] = (int16_t)((d[3] << 8) | d[2]);
          buf[n * 3 + 2] = (int16_t)((d[5] << 8) | d[4]);
          n++;
        }
      }
      SPI.endTransaction();

      sendPacket(PKT_VIB,
                 ovr ? FLAG_FIFO_OVERRUN : 0,
                 seqVib++,
                 (const uint8_t *)buf, n * 6,
                 ovr ? 0xFFFF : 0);            // exact loss unknown on overrun
      ovr = false;
      esp_task_wdt_reset();
      avail = fifoStatus(&ovr);
      if (ovr) fifoOverrunCount++;
    }
    vTaskDelay(1);                           
  }
}

// INMP441
// blocking read lives on core 0 so it doesnt stall the vibration stream
static void setupI2S() {
  const i2s_config_t i2s_config = {
    .mode = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_RX),
    .sample_rate = 16000,
    .bits_per_sample = I2S_BITS_PER_SAMPLE_32BIT,
    .channel_format = I2S_CHANNEL_FMT_ONLY_LEFT,
    .communication_format = I2S_COMM_FORMAT_STAND_I2S,
    .intr_alloc_flags = ESP_INTR_FLAG_LEVEL1,
    .dma_buf_count = 8,
    .dma_buf_len = 512,
    .use_apll = false,
    .tx_desc_auto_clear = false,
    .fixed_mclk = 0
  };
  const i2s_pin_config_t pin_config = {
    .mck_io_num = I2S_PIN_NO_CHANGE,   // omitting this zero-inits it = GPIO0!
    .bck_io_num = I2S_SCK,
    .ws_io_num = I2S_WS,
    .data_out_num = I2S_PIN_NO_CHANGE,
    .data_in_num = I2S_SD
  };
  i2s_driver_install(I2S_PORT, &i2s_config, 0, NULL);
  i2s_set_pin(I2S_PORT, &pin_config);
  i2s_start(I2S_PORT);
}

static void audioTask(void *) {
  esp_task_wdt_add(NULL);
  // 192 samples = 12 ms per packet = 398 bytes on the wire
  // same size class as the vib packets, so all three streams share the link fairly and each packet fits comfortably within one bounded-timeout write
  const int AUDIO_SAMPLES = 192;
  static int32_t raw[AUDIO_SAMPLES];
  static int16_t out[AUDIO_SAMPLES];

  for (;;) {
    esp_task_wdt_reset();
    size_t bytesIn = 0;
    i2s_read(I2S_PORT, raw, sizeof(raw), &bytesIn, portMAX_DELAY);
    int n = bytesIn / sizeof(int32_t);
    for (int i = 0; i < n; i++)
      out[i] = (int16_t)(raw[i] >> 16);        // 24-bit MSB-aligned
    sendPacket(PKT_AUDIO, 0, seqAudio++, (const uint8_t *)out, n * 2, 0);
  }
}

// GY-906
// runs in loop() on core 1
Adafruit_MLX90614 mlx = Adafruit_MLX90614();

static bool  tempSensorOk   = false;
static float objTempC       = NAN;
static float ambTempC       = NAN;
static uint32_t lastTempOkMs = 0;

static void setupMLX90614() {
  Wire.begin(MLX90614_SDA, MLX90614_SCL);
  Wire.setTimeOut(50);                         // a wedged bus must not hang us
  tempSensorOk = mlx.begin();
  lastTempOkMs = millis();
}

// setup
void setup() {
  motorPinsSafe();                      
  serialMutex = xSemaphoreCreateMutex();

  Serial.setTxBufferSize(4096);   // enlarge the TX buffer to smooth out packet bursts
  Serial.begin(3000000);
  uint32_t t0 = millis();
  while (!Serial && millis() - t0 < 5000) delay(10);   // dont wait forever

  // watchdog
  // if any task hangs, the chip resets and the reset-reason check below keeps the motor OFF after that reset instead of blindly restarting
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
  esp_task_wdt_config_t wdtCfg = {
    .timeout_ms = WDT_TIMEOUT_MS,
    .idle_core_mask = 0,
    .trigger_panic = true,
  };
  esp_task_wdt_reconfigure(&wdtCfg);
#else
  esp_task_wdt_init(WDT_TIMEOUT_MS / 1000, true);
#endif
  esp_task_wdt_add(NULL);                      // loop() task

  // 12 dB attenuation gives the full ~0-3.1 V span the divider can deliver.
  // The default only reaches about 1 V, which would clip everything above ~1 A
  // and look like a broken sensor. Zero is captured here, before the motor can
  // possibly be running -- it cannot start until loop() arms it.
  analogSetPinAttenuation(CURRENT_SENSE_PIN, ADC_11db);
  currentZeroMv = readSenseMv();

