kyriosaa/e2c-pdm/edge/esp32/firmware/mdc/mdc.ino
  esp_reset_reason_t rr = esp_reset_reason();
  bool cleanBoot = (rr == ESP_RST_POWERON || rr == ESP_RST_SW ||
                    rr == ESP_RST_USB || rr == ESP_RST_UNKNOWN);
  if (!cleanBoot) faultCode = FAULT_BAD_RESET; // WDT/panic/brownout (stay off)

  if (!setupIIS3DWB()) faultCode = (faultCode == FAULT_NONE) ? FAULT_VIB_INIT : faultCode;
  setupMLX90614();
  setupI2S();

  xTaskCreatePinnedToCore(vibTask,   "vib", 6144, NULL, 3, NULL, 1);
  xTaskCreatePinnedToCore(audioTask, "aud", 6144, NULL, 2, NULL, 0);
}

// loop
// motor starts here only when:
//    faultCode == FAULT_NONE (clean boot)   AND   host has sent 'G' (or REQUIRE_HOST_ARM == 0)    AND   the GY-906 has produced at least one valid reading
void loop() {
  static uint32_t lastStatusMs = 0;
  static bool armRequested = (REQUIRE_HOST_ARM == 0);
  static bool tempProven = false;
  static bool motorWasStarted = false;
  esp_task_wdt_reset();

  // host commands
  while (Serial.available()) {
    int c = Serial.read();
    if (c == 'G' || c == 'g') armRequested = true;
    if (c == 'X' || c == 'x') motorKill(FAULT_HOST_STOP);
    if (c == 'R' || c == 'r') {
      // pads stay held LOW through the restart and ESP_RST_SW counts as a clean boot, 
      // so the fault latch is released without touching the physical RESET button
      motorKill(FAULT_HOST_STOP);
      delay(50);
      esp_restart();
    }
  }

  // gated start (armed + interlock proven alive + no fault, once only)
  if (!motorWasStarted && armRequested && tempProven && faultCode == FAULT_NONE) {
    motorStart(MOTOR_SPEED);
    motorWasStarted = true;
  }

  // Start-up shaping: full duty, then ease down to runSpeed. Driven from the
  // loop rather than with delay() inside motorStart so the loop stays live --
  // 'X' still stops the motor part-way through, and status packets keep going.
  if (rampEndsMs && motorRunning) {
    uint32_t now = millis();
    if ((int32_t)(now - rampEndsMs) >= 0) {
      motorApply(runSpeed);                        // settled
      kickEndsMs = rampEndsMs = 0;
    } else if ((int32_t)(now - kickEndsMs) >= 0 &&
               (now - lastRampMs) >= 50) {         // 50 ms steps, not every pass
      lastRampMs = now;
      const int hi = (runSpeed >= 0) ? KICK_SPEED : -KICK_SPEED;
      const uint32_t into = now - kickEndsMs;
      motorApply(hi + (int)((int32_t)(runSpeed - hi) * (int32_t)into / (int32_t)RAMP_MS));
    }
  }

  // 1 Hz (temperature + interlocks)
  if (millis() - lastStatusMs >= 1000) {
    lastStatusMs = millis();

    float t = mlx.readObjectTempC();
    float a = mlx.readAmbientTempC();
    if (!isnan(t)) {
      objTempC = t;
      ambTempC = isnan(a) ? ambTempC : a;
      lastTempOkMs = millis();
      tempProven = true;

      // NOTE: this trips on a SINGLE over-threshold reading, with no debounce.
      // That is fail-safe in the correct direction (a spurious low reading
      // cannot suppress a trip -- the next 1 Hz sample would still catch it).
      //
      // But the pilot sessions show the MLX90614 producing roughly 2 spurious
      // single-sample excursions per 6 h run, in which obj and amb move
      // together by 1.5-2.6 C for exactly one sample and then return. At the
      // present ~25 C operating point a 2.6 C excursion is nowhere near the
      // 70 C threshold, so no spurious trip is possible today. Once a
      // mechanical load raises the steady-state case temperature, consider
      // requiring 2 consecutive over-threshold readings before latching --
      // one extra second above the threshold is thermally negligible, and it
      // stops a single glitch from ending an overnight run.
      // Not implemented yet: it is a change to safety-critical behaviour and
      // should be a deliberate decision, not a side effect.
      if (motorRunning && objTempC >= TRIP_TEMP_C)
        motorKill(FAULT_OVERTEMP);
    }

    // stop the motor if the interlock sensor goes silent
    if (motorRunning && millis() - lastTempOkMs > TEMP_STALE_MS)
      motorKill(FAULT_TEMP_SENSOR);

    if (motorRunning && millis() > MAX_RUN_MS)
      motorKill(FAULT_RUNTIME_DONE);

    // status packet
    StatusPayload s;
    s.objTempC      = objTempC;
    s.ambTempC      = ambTempC;
    s.motorRunning  = motorRunning ? 1 : 0;
    s.faultCode     = faultCode;
    s.uptimeS       = millis() / 1000;
    s.vibPackets    = seqVib;
    s.audioPackets  = seqAudio;
    s.fifoOverruns  = fifoOverrunCount;
    s.txDropped     = txDroppedPackets;
    s.ctrl1XL       = iisCtrl1XL;
    s.pwmDuty       = appliedDuty;
    s.currentMa     = readCurrentMa();
    sendPacket(PKT_STATUS, 0, seqStatus++, (const uint8_t *)&s, sizeof(s), 0);
  }

  vTaskDelay(pdMS_TO_TICKS(100));
}
